# Practice_Part_05: Data Cleaning And Preparation Solution

#### Exercise_01 Solution
For the titanic data in the directory 'data/titanic':
1. Display the data with 'name' column as the index
2. Count the number of null and non-null values in the column 'body' using 'isnull' and 'notnull' methods
3. Drop the rows and columns which are having all the null values
4. Replace all the null values of titanic data with '0'

In [1]:
import pandas as pd
import numpy as np

1. Display the data with 'name' column as the index

In [2]:
titanic_data = pd.read_csv('data/titanic/original_titanic.csv', index_col='name')
titanic_data

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

2. Count the number of null and non-null values in the column 'body' using 'isnull' and 'notnull' methods

In [3]:
titanic_data['body'].isnull()

name
Allen, Miss. Elisabeth Walton                       True
Allison, Master. Hudson Trevor                      True
Allison, Miss. Helen Loraine                        True
Allison, Mr. Hudson Joshua Creighton               False
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)     True
                                                   ...
Zabour, Miss. Hileni                               False
Zabour, Miss. Thamine                               True
Zakarian, Mr. Mapriededer                          False
Zakarian, Mr. Ortin                                 True
Zimmerman, Mr. Leo                                  True
Name: body, Length: 1309, dtype: bool

In [4]:
len(titanic_data['body'][titanic_data['body'].isnull()])

1188

In [5]:
titanic_data['body'].notnull()

name
Allen, Miss. Elisabeth Walton                      False
Allison, Master. Hudson Trevor                     False
Allison, Miss. Helen Loraine                       False
Allison, Mr. Hudson Joshua Creighton                True
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    False
                                                   ...
Zabour, Miss. Hileni                                True
Zabour, Miss. Thamine                              False
Zakarian, Mr. Mapriededer                           True
Zakarian, Mr. Ortin                                False
Zimmerman, Mr. Leo                                 False
Name: body, Length: 1309, dtype: bool

In [6]:
titanic_data['body'][titanic_data['body'].notnull()]

name
Allison, Mr. Hudson Joshua Creighton    135.0
Artagaveytia, Mr. Ramon                  22.0
Astor, Col. John Jacob                  124.0
Birnbaum, Mr. Jakob                     148.0
Brandeis, Mr. Emil                      208.0
                                        ...
Williams, Mr. Leslie                     14.0
Wirz, Mr. Albert                        131.0
Youseff, Mr. Gerious                    312.0
Zabour, Miss. Hileni                    328.0
Zakarian, Mr. Mapriededer               304.0
Name: body, Length: 121, dtype: float64

In [7]:
len(titanic_data['body'][titanic_data['body'].notnull()])

121

3. Drop the rows and columns which are having all the null values

In [8]:
titanic_data.dropna(axis=0, how='all')

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [9]:
titanic_data.dropna(axis=1, how='all')

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [10]:
# titanic_data['body'].fillna(value=0)

In [11]:
# titanic_data.fillna(value={'body': 0})

4. Replace all the null values of titanic data with '0'

In [12]:
titanic_data.fillna(value=0)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,0.0,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,0.0,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,0,0.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,0,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,0,0.0,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,0,C,0,328.0,0
"Zabour, Miss. Thamine",3,0,female,0.00,1,0,2665,14.4542,0,C,0,0.0,0
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,0,C,0,304.0,0
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,0,C,0,0.0,0
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,0,S,0,0.0,0

#### Exercise_02 Solution
1. Count the number of rows which are duplicated and display them.
2. Drop the duplicated rows from the titanic data
3. Count the number of 'tickets' with repeated number and display them
4. Convert the 'sex' column names 'male' and 'female' to a title case
5. Replace the 'male' and 'female' names with the title case 'Male' and 'Female'
6. Rename the columns of titanin data to a tiltle case
7. Find the number of passangers with different age groups, and rename the age groups with different names
8. Count the number of passengers with age greater than 50
9. Use the dummy variable for the 'survived' data of titanic with the prefix 'Survived'

1. Count the number of rows which are duplicated and display them.

In [13]:
titanic_data.duplicated().value_counts()

False    1288
True       21
dtype: int64

In [14]:
titanic_data[titanic_data.duplicated()]

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Cunningham, Mr. Alfred Fleming",2,0,male,NaN,0,0,239853,0.0000,NaN,S,NaN,NaN,Belfast
"Herman, Miss. Kate",2,1,female,24.00,1,2,220845,65.0000,NaN,S,9,NaN,"Somerset / Bernardsville, NJ"
"Parkes, Mr. Francis ""Frank""",2,0,male,NaN,0,0,239853,0.0000,NaN,S,NaN,NaN,Belfast
"Baclini, Miss. Helene Barbara",3,1,female,0.75,2,1,2666,19.2583,NaN,C,C,NaN,"Syria New York, NY"
"Chip, Mr. Chang",3,1,male,32.00,0,0,1601,56.4958,NaN,S,C,NaN,"Hong Kong New York, NY"
"Johnston, Mr. Andrew G",3,0,male,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,NaN,NaN
"Johnston, Mrs. Andrew G (Elizabeth ""Lily"" Watson)",3,0,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,NaN,NaN
"Lam, Mr. Ali",3,1,male,NaN,0,0,1601,56.4958,NaN,S,C,NaN,NaN
"Lefebre, Miss. Jeannie",3,0,female,NaN,3,1,4133,25.4667,NaN,S,NaN,NaN,NaN
"Lefebre, Miss. Mathilde",3,0,female,NaN,3,1,4133,25.4667,NaN,S,NaN,NaN,NaN
"McCoy, Miss. Alicia",3,1,female,NaN,2,0,367226,23.2500,NaN,Q,16,NaN,NaN
"Moubarek, Master. Halim Gonios (""William George"")",3,1,male,NaN,1,1,2661,15.2458,NaN,C,C,NaN,NaN
"Murphy, Miss. Margaret Jane",3,1,female,NaN,1,0,367230,15.5000,NaN,Q,16,NaN,NaN
"Sage, Miss. Constance Gladys",3,0,female,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
"Sage, Miss. Dorothy Edith ""Dolly""",3,0,female,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
"Sage, Miss. Stella Anna",3,0,female,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
"Sage, Mr. Douglas Bullen",3,0,male,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
"Sage, Mr. Frederick",3,0,male,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
"Sage, Mr. George John Jr",3,0,male,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
"Samaan, Mr. Hanna",3,0,male,NaN,2,0,2662,21.6792,NaN,C,NaN,NaN,NaN
"Samaan, Mr. Youssef",3,0,male,NaN,2,0,2662,21.6792,NaN,C,NaN,NaN,NaN

In [15]:
titanic_data

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

2. Drop the duplicated rows from the titanic data

In [16]:
titanic_data.drop_duplicates()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

3. Count the number of 'tickets' with repeated number and display them

In [17]:
# titanic_data.drop_duplicates(subset=['ticket' ])

In [18]:
titanic_data['ticket'].duplicated().value_counts()

False    929
True     380
Name: ticket, dtype: int64

In [19]:
titanic_data[titanic_data['ticket'].duplicated()]

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allison, Miss. Helen Loraine",1,0,female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",1,1,female,18.0,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",1,1,female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)",3,0,female,31.0,1,0,345763,18.0000,NaN,S,NaN,NaN,NaN
"Williams, Mr. Leslie",3,0,male,28.5,0,0,54636,16.1000,NaN,S,NaN,14.0,NaN
"Yasbeck, Mrs. Antoni (Selini Alexander)",3,1,female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
"Yousseff, Mr. Gerious",3,0,male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN

4. Convert the 'sex' column names 'male' and 'female' to a title case

In [20]:
titanic_data['sex'].str.title()

name
Allen, Miss. Elisabeth Walton                      Female
Allison, Master. Hudson Trevor                       Male
Allison, Miss. Helen Loraine                       Female
Allison, Mr. Hudson Joshua Creighton                 Male
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    Female
                                                    ...
Zabour, Miss. Hileni                               Female
Zabour, Miss. Thamine                              Female
Zakarian, Mr. Mapriededer                            Male
Zakarian, Mr. Ortin                                  Male
Zimmerman, Mr. Leo                                   Male
Name: sex, Length: 1309, dtype: object

In [21]:
titanic_data.head(5)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

5. Replace the 'male' and 'female' names with the title case 'Male' and 'Female'

In [22]:
titanic_data.replace(to_replace=['male', 'female'], value=['Female', 'Male'])

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,Male,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,Female,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,Male,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,Female,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,Male,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,Male,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,Male,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,Female,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,Female,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,Female,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

6. Rename the columns of titanin data to a tiltle case

In [23]:
titanic_data.rename(columns=str.title)

,Pclass,Survived,Sex,Age,Sibsp,Parch,Ticket,Fare,Cabin,Embarked,Boat,Body,Home.Dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

7. Find the number of passangers with different age groups, and rename the age groups with different names

In [24]:
bin_size = [0, 10, 18, 25, 40, 50, 60, 70, 80, 90]
age_groups = pd.cut(titanic_data['age'], bin_size)
age_groups

name
Allen, Miss. Elisabeth Walton                      (25.0, 40.0]
Allison, Master. Hudson Trevor                      (0.0, 10.0]
Allison, Miss. Helen Loraine                        (0.0, 10.0]
Allison, Mr. Hudson Joshua Creighton               (25.0, 40.0]
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    (18.0, 25.0]
                                                       ...
Zabour, Miss. Hileni                               (10.0, 18.0]
Zabour, Miss. Thamine                                       NaN
Zakarian, Mr. Mapriededer                          (25.0, 40.0]
Zakarian, Mr. Ortin                                (25.0, 40.0]
Zimmerman, Mr. Leo                                 (25.0, 40.0]
Name: age, Length: 1309, dtype: category
Categories (9, interval[int64, right]): [(0, 10] < (10, 18] < (18, 25] < (25, 40] ... (50, 60] < (60, 70] < (70, 80] < (80, 90]]

In [25]:
age_groups.value_counts()

(25, 40]    376
(18, 25]    250
(40, 50]    132
(10, 18]    107
(0, 10]      86
(50, 60]     62
(60, 70]     27
(70, 80]      6
(80, 90]      0
Name: age, dtype: int64

In [26]:
age_groups_named = pd.cut(titanic_data['age'], bin_size, labels=['Childs', 'Youngsters', 'Youth', 'Youth_Probobly_Married', 'Middle_Age', 
                                                                'Seniors', 'Senior_Citizens', 'Aged', 'More_Aged' ])
age_groups_named.value_counts()

Youth_Probobly_Married    376
Youth                     250
Middle_Age                132
Youngsters                107
Childs                     86
Seniors                    62
Senior_Citizens            27
Aged                        6
More_Aged                   0
Name: age, dtype: int64

8. Count the number of passengers with age greater than 50

In [27]:
titanic_data[np.abs(titanic_data['age']) > 50]

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Andrews, Miss. Kornelia Theodosia",1,1,female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1,female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
"Artagaveytia, Mr. Ramon",1,0,male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
"Barkworth, Mr. Algernon Henry Wilson",1,1,male,80.0,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
"Bonnell, Miss. Elizabeth",1,1,female,58.0,0,0,113783,26.5500,C103,S,8,NaN,"Birkdale, England Cleveland, Ohio"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Nysveen, Mr. Johan Hansen",3,0,male,61.0,0,0,345364,6.2375,NaN,S,NaN,NaN,NaN
"Storey, Mr. Thomas",3,0,male,60.5,0,0,3701,NaN,NaN,S,NaN,261.0,NaN
"Svensson, Mr. Johan",3,0,male,74.0,0,0,347060,7.7750,NaN,S,NaN,NaN,NaN
"Turkula, Mrs. (Hedwig)",3,1,female,63.0,0,0,4134,9.5875,NaN,S,15,NaN,NaN
"Widegren, Mr. Carl/Charles Peter",3,0,male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN

In [28]:
len(titanic_data[np.abs(titanic_data['age']) > 50])

95

In [29]:
print("Total number of passangers with age > 50:")
print(62+27+6)

Total number of passangers with age > 50:
95

9. Use the dummy variable for the 'survived' data of titanic with the prefix 'Survived'

In [30]:
pd.get_dummies(titanic_data['survived'], prefix='Survived')

                                                 Survived_0  Survived_1
name
Allen, Miss. Elisabeth Walton                             0           1
Allison, Master. Hudson Trevor                            0           1
Allison, Miss. Helen Loraine                              1           0
Allison, Mr. Hudson Joshua Creighton                      1           0
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)           1           0
...                                                     ...         ...
Zabour, Miss. Hileni                                      1           0
Zabour, Miss. Thamine                                     1           0
Zakarian, Mr. Mapriededer                                 1           0
Zakarian, Mr. Ortin                                       1           0
Zimmerman, Mr. Leo                                        1           0

[1309 rows x 2 columns]